
#include <My2WD_V1.h>
#include <my2wd_servo.h>
void setup() 
  {
    set_move_before_moveLR(160);   //------->> ตั้งค่า เดินหน้า ถอยหลัง ก่อนการหมุน
    Acceptable_values_moveLR(1.0,  1);     //------->> ตั้งค่า error  output ที่ยอมรับได้ในการหมุน
    set_pid_moveLR(1.60, 0.00023, 0.075);   //------->> ตั้งค่า pid สำหรับหมุนตัว    ให้ปรับตัวแปรตัวสุดท้ายตัวเดียว  ถ้าหมุนเลยองศาให้เพิ่มขึ้น     **************************
    

    sensor_set();;
    sw_start();

 
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    fw_chopsticks(30, 30, 1.5, 30, "none_line") ;  //---->>วิ่งออกจากกรอบสีแดงระยะ 30 cm  หรือใช้วิ่งข้ามตะเกียบ
    fw(70, 70, 1.5, 60, "none_line") ;
    moveLR(70, -90) ;           //-->>   70 คือความเร้วในการหมุน  -90 คือ หมุนซ้าย   ถ้า 90 คือ หมุนขวา   ที่ 90 องศษ
    set_b(3);
    fw(70, 70, 1.5, 60, "none_line") ;
    moveLR(70, 90) ;
    fw(30, 30, 1.5, 20, "line") ;    //---->> วิ่งเข้าไปวาง
    Place_box();    //----------------------->>  วางกล่อง



//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
   


    
    
  }

void loop() 
    {
      
      /*
      for(int i=0; i<8; i++)
        {
             Serial.print( md_sensor(i));
             Serial.print( " ");
        }
      Serial.println( " ");
      
      if(digitalRead(9)==0 )
        {
          my.resetAngles();
        }*/
     Serial.print("my.gyro('z') :");Serial.print(my.gyro('z')); Serial.println( "   " ); 
      //Serial.print("encoder.Poss_L :");Serial.print(encoder.Poss_L()); Serial.println( "   " ); 
    
      delay(10);

}
